drlfoam/openfoam/test_cases/rotatingPinball2D/pinball_re100_12procs/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("${DRL_LIBBIN}/libPinballRotatingWallVelocity.so");

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         300;

//deltaT          0.01;

deltaT          5.0e-3;

//writeControl    adjustableRunTime;

writeControl    runTime;

writeInterval   0.125;

//purgeWrite      0;

purgeWrite      1;

writeFormat     ascii;

writePrecision  8;

timeFormat      general;

timePrecision   8;

//adjustTimeStep yes;

//maxDeltaT 0.01;

//maxCo 1.0;

//runTimeModifiable true;

runTimeModifiable false;

functions
{
    forces
    {
        type            forceCoeffs;
        libs            (forces);
        executeControl  timeStep;
        executeInterval 100;
        //writeControl    writeTime;
        writeControl    timeStep;
        writeInterval   100;
        timeStart       300;
        log yes;
        writeFields     yes;

        patches
        (
            cylinders
        );
	coefficients    (Cd Cl);
        rhoInf      1;
        rho         rhoInf;

        CofR        (-0.433 0.0 0.0);
        liftDir     (0 1 0);
        dragDir     (1 0 0);
        //pitchAxis   (0 0 1);
        magUInf     1.0;
        lRef        2.5;
        Aref        0.05;
    }
    
    field_cylinder_a
    {

        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        fields          (forceCoeff);
        //writeControl    timeStep;
        //executeControl  timeStep;
        //executeInterval 2;
        writeControl    timeStep;
        writeInterval   100;
        timeStart       300;
        operation       sum;
        regionType      faceZone;
        name            faceZone_a;
        weightField     none;
        writeFields     yes;
        surfaceFormat   raw;

    }

    field_cylinder_b
    {

        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        fields          (forceCoeff);
        //writeControl    timeStep;
        //writeControl    writeTime;
        //executeControl  timeStep;
        //executeInterval 2;
        writeControl    timeStep;
        writeInterval   100;
        timeStart       300;
        operation       sum;
        regionType      faceZone;
        name            faceZone_b;
        weightField     none;
        writeFields     yes;
        surfaceFormat   raw;

    }
    field_cylinder_c
    {

        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        fields          (forceCoeff);
        //writeControl    timeStep;
        //writeControl    writeTime;
        //executeControl  timeStep;
        //executeInterval 2;
        writeControl    timeStep;
        writeInterval   100;
        timeStart       300;
        operation       sum;
        regionType      faceZone;
        name            faceZone_c;
        weightField     none;
        writeFields     yes;
        surfaceFormat   raw;

    }

    probes
    {
        type            probes;
        libs            (sampling);

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        executeControl  timeStep;
        executeInterval 100;
        writeControl    timeStep;
        writeInterval   100;
        timeStart       300;

        // Fields to be probed
        fields          (p);

        // Optional: do not recalculate cells if mesh moves
        fixedLocations  true;

        // Optional: interpolation scheme to use (default is cell)
        interpolationScheme cell;

        probeLocations
        (
		(0.77565 -1.99156 0.005)
		(0.75253 -1.99056 0.005)
		(0.75118 -1.51555 0.005)
		(0.75397 -1.00225 0.005)
		(0.74813 -0.50268 0.005)
		(0.73365 -0.00713 0.005)
		(0.74886 0.50268 0.005)
		(0.74409 0.99760 0.005)
		(0.75532 1.51555 0.005)
		(0.75730 1.99056 0.005)
		(0.78042 1.99156 0.005)
		(0.95121 -1.99911 0.005)
		(1.00608 -1.97927 0.005)
		(0.99522 -1.49293 0.005)
		(0.99928 -0.98844 0.005)
		(1.00596 -0.51543 0.005)
		(1.00682 -0.01470 0.005)
		(0.99160 0.48577 0.005)
		(1.00195 0.98844 0.005)
		(0.99923 1.49293 0.005)
		(1.01081 1.97927 0.005)
		(0.95593 1.99911 0.005)
		(1.28221 -1.99091 0.005)
		(1.24900 -1.98951 0.005)
		(1.25422 -1.50033 0.005)
		(1.23696 -0.99298 0.005)
		(1.25702 -0.48829 0.005)
		(1.25167 -0.01477 0.005)
		(1.25833 0.48829 0.005)
		(1.23960 0.99298 0.005)
		(1.25818 1.50033 0.005)
		(1.25367 1.98951 0.005)
		(1.28687 1.99091 0.005)
		(1.49609 -1.99992 0.005)
		(1.49609 -1.99992 0.005)
		(1.49070 -1.50709 0.005)
		(1.48753 -0.99775 0.005)
		(1.49162 -0.49050 0.005)
		(1.49648 0.01484 0.005)
		(1.49291 0.49050 0.005)
		(1.49013 0.99775 0.005)
		(1.49460 1.50709 0.005)
		(1.50070 1.99992 0.005)
		(1.50070 1.99992 0.005)
		(2.00965 -1.99980 0.005)
		(2.00965 -1.99980 0.005)
		(1.98800 -1.49102 0.005)
		(1.99130 -1.00736 0.005)
		(2.00493 -0.49535 0.005)
		(2.01698 -0.01499 0.005)
		(2.00619 0.49535 0.005)
		(1.99383 1.00736 0.005)
		(1.99173 1.49102 0.005)
		(2.01415 1.99980 0.005)
		(2.01415 1.99980 0.005)
		(2.48484 -1.99846 0.005)
		(2.48484 -1.99846 0.005)
		(2.49841 -1.50533 0.005)
		(2.48475 -0.98632 0.005)
		(2.52283 -0.50024 0.005)
		(2.51186 -0.01513 0.005)
		(2.52405 0.50024 0.005)
		(2.48714 0.98632 0.005)
		(2.50203 1.50533 0.005)
		(2.48924 1.99846 0.005)
		(2.48924 1.99846 0.005)
		(2.98581 -1.99848 0.005)
		(2.98581 -1.99848 0.005)
		(2.99293 -1.48835 0.005)
		(3.01577 -0.99614 0.005)
		(2.97832 -0.50455 0.005)
		(3.00660 -0.01527 0.005)
		(2.97950 0.50455 0.005)
		(3.01809 0.99614 0.005)
		(2.99638 1.48835 0.005)
		(2.99011 1.99848 0.005)
		(2.99011 1.99848 0.005)
		(3.49538 -1.99906 0.005)
		(3.49538 -1.99906 0.005)
		(3.49018 -1.50201 0.005)
		(3.50060 -1.00512 0.005)
		(3.51329 -0.50960 0.005)
		(3.52819 -0.01542 0.005)
		(3.51444 0.50960 0.005)
		(3.50286 1.00512 0.005)
		(3.49353 1.50201 0.005)
		(3.49957 1.99906 0.005)
		(3.49957 1.99906 0.005)
		(3.99303 -1.99936 0.005)
		(3.99303 -1.99936 0.005)
		(3.98098 -1.48411 0.005)
		(3.97930 -0.98268 0.005)
		(3.98017 -0.48281 0.005)
		(3.97831 0.01555 0.005)
		(3.98122 0.48281 0.005)
		(3.98142 0.98268 0.005)
		(3.98416 1.48411 0.005)
		(3.99710 1.99936 0.005)
		(3.99710 1.99936 0.005)
...
        );

        // Optional: filter out points that haven't been found. Default
        //           is to include them (with value -VGREAT)
        includeOutOfBounds  false;
    }

}

// ************************************************************************* //
