drlfoam/openfoam/test_cases/rotatingPinball2D/pinball_re100_12procs/Allrun.pre
#!/bin/bash
cd "${0%/*}" || exit
. ${DRL_BASE:?}/openfoam/RunFunctions
#------------------------------------------------------------------------------

# create mesh
runApplication blockMesh
runApplication topoSet
# set inlet velocity
cp -r 0.org 0
#runApplication setExprBoundaryFields

# decompose and run case
runApplication decomposePar
runParallel renumberMesh -overwrite
runParallel -s "pre" pimpleFoam

#------------------------------------------------------------------------------
